# --------------------------------------------------------------------------------
# [파이썬 1일차 Codelab① - AST(추상 구문 트리)를 활용한 자동 보안 검사기]
#
# 작성자(author): 장아현
# 작성일자(date): 2026.01.26
# 변경내역(description): 위험 함수를 쓰는 예제 파일
# --------------------------------------------------------------------------------

import os
import pickle

# ---------------------------------------------------------
# eval: 문자열을 파이썬 코드로 실행함
# 외부 입력이 들어올 경우 임의 코드 실행(Remote Code Execution)
# ---------------------------------------------------------
data = "1 + 1"
result = eval(data)

# ---------------------------------------------------------
# exec:eval보다 더 위험하며, 여러 줄의 파이썬 코드를 그대로 실행
# 공격자가 시스템 명령, 파일 접근 등 모든 코드 실행 가능
# ---------------------------------------------------------
exec("print('악의적인 코드 실행 가능')")

# ---------------------------------------------------------
# pickle.load: 역직렬화 과정에서 객체 생성 시 임의 코드가 실행될 수 있음
# 신뢰되지 않은 파일을 로드하면 심각한 보안 취약점 발생
# ---------------------------------------------------------
pickle.load(open("data.pkl", "rb"))

# ---------------------------------------------------------
# os.system: 운영체제 쉘 명령을 직접 실행
# 명령어 삽입(Command Injection) 공격에 취약
# ---------------------------------------------------------
os.system("ls")
